robertinant/emt/src/ti/runtime/wiring/cc3200/variants/CC3200STK_WIFI/Board_init.c
/*
 * Copyright (c) 2015-2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ======== Board.c ========
 *  This file is responsible for setting up the board specific items for the
 *  CC3200 Sensor Tag.
 */
 
#include <stdint.h>
#include <stdbool.h>

#include <xdc/std.h>
#include <xdc/runtime/Error.h>
#include <xdc/runtime/System.h>

#include <ti/sysbios/family/arm/m3/Hwi.h>

#include <inc/hw_ints.h>
#include <inc/hw_memmap.h>
#include <inc/hw_types.h>
//#include <inc/hw_gpio.h>

#include <driverlib/rom.h>
#include <driverlib/rom_map.h>
#include <driverlib/pin.h>
#include <driverlib/prcm.h>
#include <driverlib/udma.h>
#include <driverlib/gpio.h>

#include "Board.h"

/*
 *  =============================== DMA ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(UDMACC3200_config, ".const:UDMACC3200_config")
#pragma DATA_SECTION(udmaCC3200HWAttrs, ".const:udmaCC3200HWAttrs")
#endif

#include <ti/drivers/dma/UDMACC3200.h>

#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_ALIGN(dmaControlTable, 1024)
#elif defined(__IAR_SYSTEMS_ICC__)
#pragma data_alignment=1024
#elif defined(__GNUC__)
__attribute__ ((aligned (1024)))
#endif
static tDMAControlTable dmaControlTable[64];

/*
 *  ======== dmaErrorFxn ========
 *  This is the handler for the uDMA error interrupt.
 */
static void dmaErrorFxn(uintptr_t arg)
{
    int status = MAP_uDMAErrorStatusGet();
    MAP_uDMAErrorStatusClear();

    /* Suppress unused variable warning */
    (void)status;

    while (1);
}

UDMACC3200_Object udmaCC3200Object;

const UDMACC3200_HWAttrs udmaCC3200HWAttrs = {
        .controlBaseAddr = (void *)dmaControlTable,
        .dmaErrorFxn = (UDMACC3200_ErrorFxn)dmaErrorFxn,
        .intNum = INT_UDMAERR,
        .intPriority = (~0)
};

const UDMACC3200_Config UDMACC3200_config = {
    .object = &udmaCC3200Object,
    .hwAttrs = &udmaCC3200HWAttrs
};

/*
 *  ======== Board_initGeneral ========
 */
void Board_initGeneral(void)
{
    /*  Reset DMA + other essential peripheral initialization
     *  ASSUMED by the simplelink and driverlib libraries
     */
    PRCMCC3200MCUInit();

    /* Configure pins as specified in the current configuration */

    /*
     * ======== Enable Peripheral Clocks ========
     * Enable all clocks (because wiring can use any pin in any mode
     * at runtime)
     */
    MAP_PRCMPeripheralClkEnable(PRCM_CAMERA, PRCM_RUN_MODE_CLK);

    MAP_PRCMPeripheralClkEnable(PRCM_GSPI, PRCM_RUN_MODE_CLK);

    MAP_PRCMPeripheralClkEnable(PRCM_I2CA0, PRCM_RUN_MODE_CLK);

    MAP_PRCMPeripheralClkEnable(PRCM_I2S, PRCM_RUN_MODE_CLK);

    MAP_PRCMPeripheralClkEnable(PRCM_SDHOST, PRCM_RUN_MODE_CLK);

    MAP_PRCMPeripheralClkEnable(PRCM_TIMERA0, PRCM_RUN_MODE_CLK);
    MAP_PRCMPeripheralClkEnable(PRCM_TIMERA1, PRCM_RUN_MODE_CLK);
    MAP_PRCMPeripheralClkEnable(PRCM_TIMERA2, PRCM_RUN_MODE_CLK);
    MAP_PRCMPeripheralClkEnable(PRCM_TIMERA3, PRCM_RUN_MODE_CLK);
}

/*
 * ======== GPIO driver ========
 */

#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOCC3200.h>

/* GPIO configuration structure definitions */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(GPIOCC3200_config, ".const:GPIOCC3200_config")
#pragma DATA_SECTION(gpioPinConfigs, ".data:gpioPinConfigs")
#pragma DATA_SECTION(gpioCallbackFunctions, ".data:gpioCallbackFunctions")
#endif

GPIO_PinConfig gpioPinConfigs[] = {
    /* port_pin */
    GPIOCC3200_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  0  - dummy */
                          
    /* pins 1-10 */
    GPIOCC3200_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  1  - VDD */
    GPIOCC3200_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  2  - GND */
    GPIOCC3200_GPIO_12 | GPIO_DO_NOT_CONFIG,    /*  3  - GPIO_12 SCL */
    GPIOCC3200_GPIO_13 | GPIO_DO_NOT_CONFIG,    /*  4  - GPIO_13 SDA */
    GPIOCC3200_GPIO_08 | GPIO_DO_NOT_CONFIG,    /*  5  - GPIO_08 DP12 AUDIO FS */
    GPIOCC3200_GPIO_30 | GPIO_DO_NOT_CONFIG,    /*  6  - GPIO_30 DP7 AUDIO CLK */
    GPIOCC3200_GPIO_17 | GPIO_DO_NOT_CONFIG,    /*  7  - GPIO_17 DP11 CSN */
    GPIOCC3200_GPIO_31 | GPIO_DO_NOT_CONFIG,    /*  8  - GPIO_31 DP6 */
    GPIOCC3200_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  9  - VDD */
    GPIOCC3200_GPIO_01 | GPIO_DO_NOT_CONFIG,    /*  10 - GPIO_01 DP5 UART TX */
                          
    /* pins 11-20 */
    GPIOCC3200_GPIO_16 | GPIO_DO_NOT_CONFIG,    /*  11 - GPIO_16 DP10 MOSI */
    GPIOCC3200_GPIO_02 | GPIO_DO_NOT_CONFIG,    /*  12 - GPIO_01 DP4 UART_RX */
    GPIOCC3200_GPIO_15 | GPIO_DO_NOT_CONFIG,    /*  13 - GPIO_15 DP9 MISO */
    GPIOCC3200_GPIO_25 | GPIO_DO_NOT_CONFIG,    /*  14 - GPIO_25 DP3 SOP2 */
    GPIOCC3200_GPIO_14 | GPIO_DO_NOT_CONFIG,    /*  15 - GPIO_14 DP8 SCLK */
    GPIOCC3200_GPIO_09 | GPIO_DO_NOT_CONFIG,    /*  16 - GPIO_09 DP2 */
    GPIOCC3200_GPIO_05 | GPIO_DO_NOT_CONFIG,    /*  17 - GPIO_05 DP ID */
    GPIOCC3200_GPIO_04 | GPIO_DO_NOT_CONFIG,    /*  18 - GPIO_04 DP1 BUTTON2 */
    GPIOCC3200_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  19 - POWER GOOD */
    GPIOCC3200_GPIO_10 | GPIO_DO_NOT_CONFIG,    /*  20 - GPIO_10 DP0/LED2 */
                          
    /* virtual pins 21-30 */
    GPIOCC3200_GPIO_00 | GPIO_DO_NOT_CONFIG,    /*  21 - GPIO_00 AUDIO DI */
    GPIOCC3200_GPIO_03 | GPIO_DO_NOT_CONFIG,    /*  22 - GPIO_03 BATTMON */
    GPIOCC3200_GPIO_06 | GPIO_DO_NOT_CONFIG,    /*  23 - GPIO_06 BUZZER */
    GPIOCC3200_GPIO_07 | GPIO_DO_NOT_CONFIG,    /*  24 - GPIO_07 REED */
    GPIOCC3200_GPIO_11 | GPIO_DO_NOT_CONFIG,    /*  25 - GPIO_11 BUTTON1 */
    GPIOCC3200_GPIO_22 | GPIO_DO_NOT_CONFIG,    /*  26 - GPIO_22 TMP RDY */
    GPIOCC3200_GPIO_23 | GPIO_DO_NOT_CONFIG,    /*  27 - GPIO_23 TDI/LED1 */
    GPIOCC3200_GPIO_24 | GPIO_DO_NOT_CONFIG,    /*  28 - GPIO_24 TDO/MPU INT */
    GPIOCC3200_GPIO_28 | GPIO_DO_NOT_CONFIG,    /*  29 - GPIO_28 MIC PWR */
    GPIOCC3200_GPIO_29 | GPIO_DO_NOT_CONFIG,    /*  30 - GPIO_29 JTAG TMS */
};

GPIO_CallbackFxn gpioCallbackFunctions[] = {
    /* port_pin */
    NULL,  /*  0  - dummy */

    /* pins 1-10 */
    NULL,  /*  1  - VDD */
    NULL,  /*  2  - GND */
    NULL,  /*  3  - GPIO_12 SCL */
    NULL,  /*  4  - GPIO_13 SDA */
    NULL,  /*  5  - GPIO_08 DP12 AUDIO FS */
    NULL,  /*  6  - GPIO_30 DP7 AUDIO CLK */
    NULL,  /*  7  - GPIO_17 DP11 CSN */
    NULL,  /*  8  - GPIO_31 DP6 */
    NULL,  /*  9  - VDD */
    NULL,  /*  10 - GPIO_01 DP5 UART TX */
                    
    /* pins 11-20 */
    NULL,  /*  11 - GPIO_16 DP10 MOSI */
    NULL,  /*  12 - GPIO_01 DP4 UART_RX */
    NULL,  /*  13 - GPIO_15 DP9 MISO */
    NULL,  /*  14 - DP3 */
    NULL,  /*  15 - GPIO_14 DP8 SCLK */
    NULL,  /*  16 - GPIO_09 DP2 */
    NULL,  /*  17 - GPIO_05 DP ID */
    NULL,  /*  18 - GPIO_04 DP1 BUTTON2 */
    NULL,  /*  19 - POWER GOOD */
    NULL,  /*  20 - GPIO_10 DP0/LED2 */
                    
    /* virtual pins 21-30 */
    NULL,  /*  21 - GPIO_00 AUDIO DI */
    NULL,  /*  22 - GPIO_03 BATTMON */
    NULL,  /*  23 - GPIO_06 BUZZER */
    NULL,  /*  24 - GPIO_07 REED */
    NULL,  /*  25 - GPIO_11 BUTTON1 */
    NULL,  /*  26 - GPIO_22 TMP RDY */
    NULL,  /*  27 - GPIO_23 TDI/LED1 */
    NULL,  /*  28 - GPIO_24 TDO/MPU INT */
    NULL,  /*  29 - GPIO_28 MIC PWR */
    NULL,  /*  30 - GPIO_29 JTAG TMS */
};

/* User requested callback functions for the GPIO input signals */

