robertinant/emt/src/ti/runtime/wiring/cc3200/variants/CC3200STK_WIFI/Board_init.c
/* The device-specific GPIO_config structure */
const GPIOCC3200_Config GPIOCC3200_config = {
    .pinConfigs = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = sizeof(gpioPinConfigs)/sizeof(GPIO_PinConfig),
    .numberOfCallbacks = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority = (~0)
};

/*
 *  ======== Board_initGPIO ========
 */
void Board_initGPIO(void)
{
    /* set up initial GPIO pin configurations */
    GPIO_init();
}

/*
 * ======== I2C ========
 */
#include <ti/drivers/I2C.h>
#include <ti/drivers/i2c/I2CCC3200.h>
#include <driverlib/i2c.h>

I2CCC3200_Object i2cCC3200Objects[Board_I2CCOUNT];

/* I2C configuration structure */
const I2CCC3200_HWAttrs i2cCC3200HWAttrs[Board_I2CCOUNT] = {
    {
        .baseAddr = I2CA0_BASE, 
        .intNum = INT_I2CA0,
        .intPriority = (~0)
    }
};

const I2C_Config I2C_config[] = {
    {
        .fxnTablePtr = &I2CCC3200_fxnTable,
        .object = &i2cCC3200Objects[0],
        .hwAttrs = &i2cCC3200HWAttrs[0]
    },
    {NULL, NULL, NULL}
};

/*
 *  ======== Board_openI2C ========
 *  Initialize the I2C driver.
 *  Initialize the I2C port's pins.
 *  Open the I2C port.
 */
I2C_Handle Board_openI2C(UInt i2cPortIndex, I2C_Params *i2cParams)
{
    
    /* Initialize the I2C driver */
    /* By design, I2C_init() is idempotent */
    I2C_init();
    
    /* initialize the pins associated with the respective I2C */
    switch (i2cPortIndex) {
        case 0:
            /*
             * Configure SensorTag I2C pin: MPU Data (via I2C)
             *     device pin: 3 (I2C_SCL)
             *     energia pin: 3
             */
            MAP_PinTypeI2C(PIN_03, PIN_MODE_5);

            /*
             * Configure Configure SensorTag I2C pin: MPU Data (via I2C)
             *     device pin: 4 (I2C_SDA)
             *     energia pin: 4
             */
            MAP_PinTypeI2C(PIN_04, PIN_MODE_5);
            break;

        default:
            return (NULL);
    }

    /* open the I2C */
    return (I2C_open(i2cPortIndex, i2cParams));
}

/*
 * ======== PWM driver ========
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC3200.h>
#include <driverlib/timer.h>

PWMTimerCC3200_Object pwmCC3200Objects[Board_PWMCOUNT];

PWMTimerCC3200_HWAttrsV1 pwmCC3200HWAttrs[Board_PWMCOUNT] = {
    {
	    .timerBaseAddr = TIMERA0_BASE,
		.halfTimer = TIMER_A,
        .pinTimerPwmMode = PIN_MODE_5,
        .pinId = PIN_01,
        .gpioBaseAddr = GPIOA1_BASE,
        .gpioPinIndex = GPIO_PIN_2
	},
    {
	    .timerBaseAddr = TIMERA0_BASE,
		.halfTimer = TIMER_B,
        .pinTimerPwmMode = PIN_MODE_5,
        .pinId = PIN_01,
        .gpioBaseAddr = GPIOA1_BASE,
        .gpioPinIndex = GPIO_PIN_2
	},
    {
	    .timerBaseAddr = TIMERA1_BASE,
		.halfTimer = TIMER_A,
        .pinTimerPwmMode = PIN_MODE_9,
        .pinId = PIN_01,
        .gpioBaseAddr = GPIOA1_BASE,
        .gpioPinIndex = GPIO_PIN_2
	},
    {
	    .timerBaseAddr = TIMERA1_BASE,
		.halfTimer = TIMER_B,
        .pinTimerPwmMode = PIN_MODE_9,
        .pinId = PIN_01,
        .gpioBaseAddr = GPIOA1_BASE,
        .gpioPinIndex = GPIO_PIN_2
	},
    {
	    .timerBaseAddr = TIMERA2_BASE,
		.halfTimer = TIMER_A,
        .pinTimerPwmMode = PIN_MODE_3,
        .pinId = PIN_01,
        .gpioBaseAddr = GPIOA1_BASE,
        .gpioPinIndex = GPIO_PIN_2
	},
    {
	    .timerBaseAddr = TIMERA2_BASE,
		.halfTimer = TIMER_B,
        .pinTimerPwmMode = PIN_MODE_3,
        .pinId = PIN_01,
        .gpioBaseAddr = GPIOA1_BASE,
        .gpioPinIndex = GPIO_PIN_2
	},
    {
	    .timerBaseAddr = TIMERA3_BASE,
		.halfTimer = TIMER_A,
        .pinTimerPwmMode = PIN_MODE_3,
        .pinId = PIN_01,
        .gpioBaseAddr = GPIOA1_BASE,
        .gpioPinIndex = GPIO_PIN_2
	},
    {
	    .timerBaseAddr = TIMERA3_BASE,
		.halfTimer = TIMER_B,
        .pinTimerPwmMode = PIN_MODE_3,
        .pinId = PIN_01,
        .gpioBaseAddr = GPIOA1_BASE,
        .gpioPinIndex = GPIO_PIN_2
	},
};

const PWM_Config PWM_config[] = {
    {&PWMTimerCC3200_fxnTable, &pwmCC3200Objects[0], &pwmCC3200HWAttrs[0]},
    {&PWMTimerCC3200_fxnTable, &pwmCC3200Objects[1], &pwmCC3200HWAttrs[1]},
    {&PWMTimerCC3200_fxnTable, &pwmCC3200Objects[2], &pwmCC3200HWAttrs[2]},
    {&PWMTimerCC3200_fxnTable, &pwmCC3200Objects[3], &pwmCC3200HWAttrs[3]},
    {&PWMTimerCC3200_fxnTable, &pwmCC3200Objects[4], &pwmCC3200HWAttrs[4]},
    {&PWMTimerCC3200_fxnTable, &pwmCC3200Objects[5], &pwmCC3200HWAttrs[5]},
    {&PWMTimerCC3200_fxnTable, &pwmCC3200Objects[6], &pwmCC3200HWAttrs[6]},
    {&PWMTimerCC3200_fxnTable, &pwmCC3200Objects[7], &pwmCC3200HWAttrs[7]},
    {NULL, NULL, NULL}
};

/*
 *  ======== Board_initPWM ========
 */
void Board_initPWM(void)
{
    PWM_init();
}

/*
 * ======== SPI driver ========
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC3200DMA.h>
#include <driverlib/spi.h>

static SPICC3200DMA_Object SPICC3200DMAObjects[Board_SPICOUNT];

#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_ALIGN(spiCC3200DMAscratchBuf, 32)
#elif defined(__IAR_SYSTEMS_ICC__)
#pragma data_alignment=32
#elif defined(__GNUC__)
__attribute__ ((aligned (32)))
#endif
static uint32_t spiCC3200DMAscratchBuf[Board_SPICOUNT];

/* SPI configuration structure */
static const SPICC3200DMA_HWAttrs spiCC3200DMAHWAttrs[Board_SPICOUNT] = {
    {
        .baseAddr = GSPI_BASE,
        .intNum = INT_GSPI,
        .intPriority = 0xC0,       /* make SPI interrupt one priority higher than default */
        .spiPRCM = PRCM_GSPI,
        .csControl = SPI_HW_CTRL_CS,
        .csPolarity = SPI_CS_ACTIVELOW,
        .pinMode = SPI_4PIN_MODE,
        .turboMode = SPI_TURBO_OFF,
        .scratchBufPtr = &spiCC3200DMAscratchBuf[0],
        .defaultTxBufValue = 0,
        .rxChannelIndex = UDMA_CH6_GSPI_RX,
        .txChannelIndex = UDMA_CH7_GSPI_TX,
        .minDmaTransferSize = 100
    },
    {
        .baseAddr = LSPI_BASE,
        .intNum = INT_LSPI,
        .intPriority = (~0),
        .spiPRCM = PRCM_LSPI,
        .csControl = SPI_SW_CTRL_CS,
        .csPolarity = SPI_CS_ACTIVEHIGH,
        .pinMode = SPI_4PIN_MODE,
        .turboMode = SPI_TURBO_OFF,
        .scratchBufPtr = &spiCC3200DMAscratchBuf[1],
        .defaultTxBufValue = 0,
        .rxChannelIndex = UDMA_CH12_LSPI_RX,
        .txChannelIndex = UDMA_CH13_LSPI_TX,
        .minDmaTransferSize = 100
    }
};

